Table of Contents
 Class LoadGroupEC
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load group for EC
[OpenModelClass("CI.StructModel.Loading.LoadGroupEC,CI.Loading", "CI.StructModel.Loading.ILoadGroup,CI.BasicTypes", typeof(LoadGroup))]
public class LoadGroupEC : LoadGroup
Inheritance
object
OpenObject
OpenElementId
LoadGroup
LoadGroupEC
Inherited Members
 LoadGroup.Name
 LoadGroup.Relation
 LoadGroup.GroupType
 LoadGroup.GammaQ
 LoadGroup.Dzeta
 LoadGroup.GammaGInf
 LoadGroup.GammaGSup
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create a load group.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
Constructors
 LoadGroupEC()
Constructor
public LoadGroupEC()
Properties
 Psi0
ψ 0
public double Psi0 { get; set; }
Property Value
double
 Psi1
ψ 1
public double Psi1 { get; set; }
Property Value
double
 Psi2
ψ 2
public double Psi2 { get; set; }
Property Value
double
 Edit this page